/* BizSimAI - Korean Localization */

/* Common */
"app.name" = "BizSimAI";
"common.login" = "로그인";
"common.logout" = "로그아웃";
"common.save" = "저장";
"common.cancel" = "취소";
"common.error" = "오류";
"common.loading" = "로딩 중...";
"common.success" = "성공";
"common.retry" = "다시 시도";
"common.submit" = "제출";
"common.back" = "뒤로";
"common.done" = "완료";
"common.delete" = "삭제";
"common.edit" = "편집";
"common.close" = "닫기";

/* Authentication */
"auth.professor_login" = "교수 로그인";
"auth.student_access" = "학생 접속";
"auth.username" = "사용자 이름";
"auth.password" = "비밀번호";
"auth.student_id" = "학번";
"auth.full_name" = "성명";
"auth.team_name" = "팀 이름";
"auth.register" = "가입 및 참여";
"auth.sign_in_apple" = "Apple로 로그인";
"auth.sign_in_google" = "Google로 로그인";
"auth.session_expired" = "세션이 만료되었습니다. 다시 로그인해 주세요.";

/* Session */
"session.create" = "세션 만들기";
"session.join" = "세션 참여";
"session.code" = "세션 코드";
"session.round" = "라운드 %d / %d";
"session.status_waiting" = "플레이어 대기 중";
"session.status_active" = "진행 중";
"session.status_completed" = "완료";
"session.end" = "세션 종료";
"session.delete" = "세션 삭제";

/* Decisions */
"decision.submit" = "의사결정 제출";
"decision.submitted" = "의사결정이 제출됨";
"decision.over_budget" = "예산 초과";
"decision.invalid" = "유효하지 않은 의사결정";

/* Results */
"results.leaderboard" = "리더보드";
"results.profit" = "이익";
"results.revenue" = "수익";
"results.market_share" = "시장 점유율";
"results.stock_price" = "주가";
"results.cumulative" = "누적";

/* Sync */
"sync.online" = "온라인";
"sync.offline" = "오프라인";
"sync.syncing" = "동기화 중...";
"sync.error" = "동기화 실패";
"sync.saved_locally" = "로컬에 저장됨";

/* Professor */
"prof.dashboard" = "대시보드";
"prof.sessions" = "세션";
"prof.analytics" = "분석";
"prof.announcements" = "공지사항";
"prof.grade_mapping" = "성적 매핑";

/* Student */
"student.team_dashboard" = "팀 대시보드";
"student.ai_coach" = "AI 코치";
"student.performance" = "성과";

/* Navigation */
"nav.home" = "홈";
"nav.settings" = "설정";
"nav.profile" = "프로필";
"nav.help" = "도움말";

/* Errors */
"error.network" = "네트워크 오류. 연결을 확인해 주세요.";
"error.server" = "서버 오류. 나중에 다시 시도해 주세요.";
"error.unauthorized" = "인증되지 않음. 다시 로그인해 주세요.";
"error.not_found" = "리소스를 찾을 수 없습니다.";
